<?php

namespace Database\Seeders;

use App\Models\City;
use App\Models\Province;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class CitySeeder extends Seeder
{
    private array $provinces = [
        'آذربایجان شرقی' => ['تبریز','مراغه','مرند','میانه','اهر','بناب','سراب','شبستر','اسکو', 'خسروشاه','آذرشهر','بستان‌آباد','هریس','هشترود'],
        'آذربایجان غربی' => ['ارومیه','خوی','مهاباد','بوکان','میاندوآب','سلماس','نقده','پیرانشهر','سردشت','تکاب','شاهین‌دژ','ماکو','اشنویه'],
        'اردبیل' => ['اردبیل','پارس‌آباد','مشگین‌شهر','خلخال','گرمی','بیله‌سوار','نمین','نیر','کوثر'],
        'اصفهان' => ['اصفهان','کاشان','نجف‌آباد','خمینی‌شهر','شاهین‌شهر','فولادشهر','مبارکه','گلپایگان','نطنز','آران و بیدگل','سمیرم','شهرضا'],
        'البرز' => ['کرج','فردیس','نظرآباد','هشتگرد','طالقان','اشتهارد','ماهدشت'],
        'ایلام' => ['ایلام','دهلران','ایوان','آبدانان','دره‌شهر','مهران'],
        'بوشهر' => ['بوشهر','برازجان','گناوه','دیر','دیلم','کنگان','جم','عسلویه'],
        'تهران' => ['تهران','اسلام‌شهر','شهریار','قدس','رباط‌کریم','بهارستان','ورامین','قرچک','پاکدشت','ری','دماوند','فیروزکوه','پردیس'],
        'چهارمحال و بختیاری' => ['شهرکرد','بروجن','فارسان','لردگان','کیان'],
        'خراسان جنوبی' => ['بیرجند','قائن','فردوس','طبس','نهبندان','سرایان'],
        'خراسان رضوی' => ['مشهد','نیشابور','سبزوار','تربت حیدریه','قوچان','کاشمر','گناباد','تایباد','خواف','چناران'],
        'خراسان شمالی' => ['بجنورد','شیروان','اسفراین','فاروج','جاجرم'],
        'خوزستان' => ['اهواز','آبادان','خرمشهر','دزفول','اندیمشک','ماهشهر','شادگان','بهبهان','ایذه','شوش','شوشتر','رامهرمز'],
        'زنجان' => ['زنجان','ابهر','خرمدره','قیدار','طارم'],
        'سمنان' => ['سمنان','شاهرود','دامغان','گرمسار','مهدی‌شهر'],
        'سیستان و بلوچستان' => ['زاهدان','زابل','چابهار','ایرانشهر','خاش','سراوان','کنارک','نیک‌شهر'],
        'فارس' => ['شیراز','مرودشت','کازرون','جهرم','فسا','لار','داراب','اقلید','آباده'],
        'قزوین' => ['قزوین','الوند','آبیک','تاکستان','بوئین‌زهرا'],
        'قم' => ['قم'],
        'کردستان' => ['سنندج','سقز','بانه','مریوان','قروه','بیجار'],
        'کرمان' => ['کرمان','رفسنجان','جیرفت','سیرجان','بم','زرند','کهنوج'],
        'کرمانشاه' => ['کرمانشاه','اسلام‌آباد غرب','جوانرود','پاوه','سنقر','کنگاور'],
        'کهگیلویه و بویراحمد' => ['یاسوج','دوگنبدان','دهدشت','لیکک'],
        'گلستان' => ['گرگان','گنبد کاووس','علی‌آباد کتول','آق‌قلا','بندرترکمن'],
        'گیلان' => ['رشت','انزلی','لاهیجان','لنگرود','آستارا','رودسر','صومعه‌سرا','فومن'],
        'لرستان' => ['خرم‌آباد','بروجرد','دورود','الیگودرز','کوهدشت','نورآباد'],
        'مازندران' => ['ساری','بابل','آمل','قائم‌شهر','نوشهر','چالوس','تنکابن','بهشهر','بابلسر'],
        'مرکزی' => ['اراک','ساوه','خمین','محلات','دلیجان'],
        'هرمزگان' => ['بندرعباس','قشم','بندر لنگه','میناب','حاجی‌آباد','کیش'],
        'همدان' => ['همدان','ملایر','نهاوند','تویسرکان','کبودرآهنگ'],
        'یزد' => ['یزد','میبد','اردکان','بافق','ابرکوه','تفت'],
    ];

    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        foreach ($this->provinces as $province => $cities) {
            $createdProvince = Province::query()->firstOrCreate(['name' => $province]);

            foreach ($cities as $city) {
                City::query()->firstOrCreate([
                   'name' => $city,
                   'province_id' => $createdProvince->id,
                ]);
            }
        }
    }
}
